package Solo.Expections;
/*ИСКЛЮЧЕНИЯ
* Исключения-это проблема, которая возникает во время выполнения программы.
* Исключениями называют ненормальное завершение программыю
* Обработка исключений-это мощный механизм, который устраняет ошибки во
* время выполнения, чтобы поддерживать нормальное течение приложения.
* Исключение может произойти по многим разным причинам. Например:
* -Пользователь ввел недопустимы данные.
* -Невозможно найти файл, который нужно открыть.
* -Сетевое соединение было потеряно во время обмена данными.
* -Недостаточно память и другие проблемы, связанные с физическими ресурсами*/

/*Существует два типа исключений,
 ПРОВЕРЯЕМЫЕ и НЕПРОВЕРЯЕМЫЕ (также называемые runtime).
 Основное отличие в том, что проверяемые исключения проверяются при компиляции,
 в то время как непроверяемые исключения проверяются во время выполнения.
 Thread.sleep() выбрасывает исключение InterruptedException. Это пример
 проверяемого исключения. Ваш код не будет компилироваться, пока вы не
 обработаете исключение.*/
public class Main {
}
