package Solo.ArrayList;
/*Java API предоставляет специальные классы для хранения и манипуляции группами объектов.
* Один ищ таких ArrayList. Стандартные массивы Java имеют фиксированнцю длину, что означает,
* что после ихс оздания они не могут расширяться или сокращаться.
* С другой стороны, ArrayList создаются с начальным размером, но когда этот размер
* превышен, коллекция автоматически увеличивается.
* Когда объекты удаляются, размер ArrayList может уменьшится. Обратите внимание,
* что класс ArrayList находится в пакете java.util, поэтому его необходимо импортировать
* перед использованием.
* Можно дополнительно задавтьь capacity type
* ArrayList<String> colors = new ArrayList<String>(10);
* ArrayList хранит объекты поэтому необходимо использовать Integer вместо int*/
public class Main {
}
