package Solo.ComparingObjectsEquals;
/*СРАВНЕНИЕ ОБЪЕКТОВ
* КОгда создаются объекты, переменные хранят ссылки на эти объекты.
* Таким образом, когда вы сравниваете объекты с мпомощью оператора проверки на равенство(==),
* он фактическ сравнивает ссылки, а не значения объектов.
* ==========================================================================================
* equals()
* У каждого объекта есть предопределенный метод equals(), который используется для
* семантического сравнения на равенство. Но, чтобы он работал для наших классов,
* нам нужно переопределить его и проверить необходимые условия.
* Существует просто й и быстрый способ генерации метода equals(), помимо его ручного написания.
* Автоматически сгенерированный код hashCode() использкется для определения
* места хранения объекта внутри системы. Когда вы реализуете equals, вы должны также реализовать hashCode
*/

public class Main {
}
