package Solo.Abstraction;
/*АБСТРАКЦИЯ
* Данная абстракиця предоставляет внешнему миру только необходимую информацию, в процессе представления
*  существенных особенностей, без включения деталей реализации.
* Хорошим примером из реального мира является книга. Когда вы слышите книга, вы не знаете точных спецификаций
* таких как количество страниц, цвет или рахмер, но вы понимаете идею или абстракцию книги.
* Концепция абстракци заключается в том, что вы фокусируете на существенных качествах, а не на конкретных
* характеристиках одного кокретного примера.
* В Джава абстракция достигается с помощью абстрактных классов и интерфейсов.
* Абстрактный класс определяется с использованием ключевого слова abstract.
* -Если класс объявлен как абстрактный , его нельзя иницировать( нельзя создать объекты  этого типа).
* -Чтобы использовать абстрактный класс, вы должны унаследовать его от другого класса.
* -Любой класс, содержащий абстрактный метод, должен быть определен как абстрактный.
* АБСТРАКТНЫЙ МЕТОД - это медот, который объявлен без реализации
* (без скобок и с последующим точкой с запятой):abstract void walk();
* */
public class Main {
}
