package PracticeDays.Day1;

public class Task1 {
    /*Вывести на экран слов Джава в строку, чтобы оно повторилось 10 раз используя while*/
    public static void main(String[] args) {
        int counter=0;
        while (counter<10){
            System.out.print("Java ");
            counter++;
        }
    }
}
